1s/ERP/Conf/Enums/УсловияПредоставленияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УсловияПредоставленияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаРазовыйОбъемПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаНакопленныйОбъемПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПробнуюПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПервуюПродажуПартнеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаВремяПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаГрафикОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаФормуОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаНаличиеКартыЛояльности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграничениеПоГруппеПользователей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КартаЛояльностиНеЗарегистрирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВхождениеПартнераВСегмент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаДеньРожденияКлиента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/УсловияПредоставленияСкидокНаценок/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ИспользоватьСегментыПартнеров = ПолучитьФункциональнуюОпцию("ИспользоватьСегментыПартнеров");
	ИспользоватьКартыЛояльности = ПолучитьФункциональнуюОпцию("ИспользоватьКартыЛояльности");
	ИспользоватьГруппыПользователей = ПолучитьФункциональнуюОпцию("ИспользоватьГруппыПользователей");
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений();
	Для Каждого ТекЭлемент Из Перечисления.УсловияПредоставленияСкидокНаценок Цикл
		Если ТекЭлемент = Перечисления.УсловияПредоставленияСкидокНаценок.ВхождениеПартнераВСегмент
			И Не ИспользоватьСегментыПартнеров Тогда
			Продолжить;
		ИначеЕсли ТекЭлемент = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаНаличиеКартыЛояльности
			И Не ИспользоватьКартыЛояльности Тогда
			Продолжить;
		ИначеЕсли ТекЭлемент = Перечисления.УсловияПредоставленияСкидокНаценок.КартаЛояльностиНеЗарегистрирована
			И Не ИспользоватьКартыЛояльности Тогда
			Продолжить;
		ИначеЕсли ТекЭлемент = Перечисления.УсловияПредоставленияСкидокНаценок.ОграничениеПоГруппеПользователей
			И Не ИспользоватьГруппыПользователей Тогда
			Продолжить;
		ИначеЕсли ТекЭлемент = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаПробнуюПродажу
			И Не ИспользоватьСегментыПартнеров Тогда
			Продолжить;
		Иначе
			ДанныеВыбора.Добавить(ТекЭлемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
